const conferences = {
    "Буковинська": "Буковинська",
    "Південна": "Південна",
    "Дніпровська": "Дніпровська",
    "Західна": "Західна",
    "Київська": "Київська",
    "Подільська": "Подільська",
    "Центральна": "Центральна",
    "Східно-Дніпровська": "Східно-Дніпровська",
}
exports.conferences = conferences;


const CURRENT_STEP_ENUM = {
    "1. conference": "1. conference",
    "2. town": "2. town",
    "3. date": "3. date",
    "4. description": "4. description",
    "5. phone": "5. phone",
    "6. bystander": "6. bystander",
    "7. load files": "7. load files",
    "chatId": "",
};
exports.CURRENT_STEP_ENUM = CURRENT_STEP_ENUM;

const DENOMINATION_CALLBACK_LIST = {
        /**
         * Catolics
         */
        "1. Римсько-католицька церква в Україні":"1denom",
        "2. Українська греко-католицька церква":"2denom",
        "3. Мукачівська греко-католицька єпархія":"3denom",

        /**
         * Pravoslav
         */
        "4. Православна церква України":"4denom",
        "5. Українська православна церква (Московський патріархат)":"5denom",
        "6. Українська єпархія Вірменської апостольської церкви":"6denom",
        /**
         * Protestans
         */
        "7. Церква євангельських християн-баптистів в Україні":"7denom",
        "8. Церква християн віри євангельської-п'ятидесятників в Україні":"8denom",
        "9. Українська Лютеранська Церква":"9denom",
        "10. Українська Уніонна Конференція Церкви адвентистів сьомого дня":"10denom",
        "11. Закарпатська реформатська Церква":"11denom",
        "12. Центр харизматичних християнських Церков України (Повного Євангелія)":"12denom",
};

// const DENOMINATION_CALLBACK_LIST = {
//         /**
//          * Catolics
//          */
//         "1. Римсько-католицька церква в Україні":"1. Римсько-католицька церква в Україні",
//         "2. Українська греко-католицька церква":"2. Українська греко-католицька церква",
//         "3. Мукачівська греко-католицька єпархія":"3. Мукачівська греко-католицька єпархія",
//
//         /**
//          * Pravoslav
//          */
//         "4. Православна церква України":"4. Православна церква України",
//         "5. Українська православна церква (Московський патріархат)":"5. Українська православна церква (Московський патріархат)",
//         "6. Українська єпархія Вірменської апостольської церкви":"6. Українська єпархія Вірменської апостольської церкви",
//         /**
//          * Protestans
//          */
//         "7. Церква євангельських християн-баптистів в Україні":"7. Церква євангельських християн-баптистів в Україні",
//         "8. Церква християн віри євангельської-п'ятидесятників в Україні":"8. Церква християн віри євангельської-п'ятидесятників в Україні",
//         "9. Українська Лютеранська Церква":"9. Українська Лютеранська Церква",
//         "10. Українська Уніонна Конференція Церкви адвентистів сьомого дня":"10. Українська Уніонна Конференція Церкви адвентистів сьомого дня",
//         "11. Закарпатська реформатська Церква":"11. Закарпатська реформатська Церква",
//         "12. Центр харизматичних християнських Церков України (Повного Євангелія)":"12. Центр харизматичних християнських Церков України (Повного Євангелія)",
// };
exports.DENOMINATION_CALLBACK_LIST = DENOMINATION_CALLBACK_LIST;


const REGIONS = {
    "1. Київська": "Київська",
    "2. Черкаська": "Черкаська",
    "3. Кіровоградська": "Кіровоградська",
    "4. Запорізька": "Запорізька",
    "5. Миколаївська": "Миколаївська",
    "6. Одеська": "Одеська",
    "7. Полтавська": "Полтавська",
    "8. Сумська": "Сумська",
    "9. Харківська": "Харківська",
    "10. Херсонська": "Херсонська",
    "11. Чернігівська": "Чернігівська",
    "12. Дніпропетровська": "Дніпропетровська",
}
exports.REGIONS = REGIONS;
